app/views/genres/show.html.erb

  <ul>
    <% @genre.songs.each do |song|  %>
---
SELECT "songs".* FROM "songs" INNER JOIN "song_genres" ON "songs"."id" = "song_genres"."song_id" WHERE "song_genres"."genre_id" = $1  [["genre_id", 1]]

  <ul>
    <% @genre.artists.each do |artist|  %>
---
SELECT "artists".* FROM "artists" INNER JOIN "songs" ON "artists"."id" = "songs"."artist_id" INNER JOIN "song_genres" ON "songs"."id" = "song_genres"."song_id" WHERE "song_genres"."genre_id" = $1  [["genre_id", 1]]