app/views/artists/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "song_genres" ON "genres"."id" = "song_genres"."genre_id" INNER JOIN "songs" ON "song_genres"."song_id" = "songs"."id" WHERE "songs"."artist_id" = $1  [["artist_id", 2]]
---
  <ul>
    <% @artist.genres.uniq.each do |genre|  %>