app/views/songs/edit.html.erb

SELECT "artists".* FROM "artists"
---
<p>Name: <%= f.text_field :name %></p>
<p><%= collection_select(:song, :artist_id, Artist.all, :id, :name, prompt: true) %></p>

SELECT "genres".* FROM "genres"
---
<p>Genres:</p>
<p><%= collection_check_boxes(:song, :genre_ids, Genre.all, :id, :name) %></p>