app/views/songs/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "song_genres" ON "genres"."id" = "song_genres"."genre_id" WHERE "song_genres"."song_id" = $1  [["song_id", 1]]
---
<ul>
<% @song.genres.each do |genre| %>