app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)
    if @artist.save
---
INSERT INTO "artists" ("name") VALUES ($1) RETURNING "id"  [["name", "Emma's Revolution"]]

  def update
    @artist.update(artist_params)
---
UPDATE "artists" SET "name" = $1 WHERE "artists"."id" = $2  [["name", "Robert Zimmerman"], ["id", 3]]

  def set_artist
    @artist = Artist.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]