app/controllers/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO "genres" ("name") VALUES ($1) RETURNING "id"  [["name", "Rock"]]

  def update
      @genre.update(genre_params)
---
UPDATE "genres" SET "name" = $1 WHERE "genres"."id" = $2  [["name", "Blues/funk"], ["id", 3]]

  def destroy
    @genre.song_genres.each do |song_genre|
      song_genre.destroy
---
SELECT "song_genres".* FROM "song_genres" WHERE "song_genres"."genre_id" = $1  [["genre_id", 5]]
DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 5]]

  def set_genre
    @genre = Genre.find_by(id: params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]