app/controllers/songs_controller.rb

  def create
    @song = Song.new(name: song_params[:name])
    genres = song_params[:genre_ids]
    genres.delete('')
    @song.artist = @artist #check this out
    @song.genre_ids = genres
    unless genre_params[:name].blank?
      @song.genres << Genre.create(genre_params)
    end
    if artist_params[:name].blank?
      @song.artist = Artist.find(song_params[:artist_id])
---
INSERT INTO "artists" ("name") VALUES ($1) RETURNING "id"  [["name", "Sarah Vaughn"]]
INSERT INTO "song_genres" ("song_id", "genre_id") VALUES ($1, $2) RETURNING "id"  [["song_id", 1], ["genre_id", 2]]
INSERT INTO "songs" ("name", "artist_id") VALUES ($1, $2) RETURNING "id"  [["name", "Since I Fell for You"], ["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Sarah Vaughn"], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN (3, 4, 5)

  def update
    @song.update(song_params)
    unless genre_params[:name].blank?
      @song.genres << Genre.create(genre_params)
    end
    if artist_params[:name].blank?
      @song.artist = Artist.find(song_params[:artist_id])
    else
      @song.artist = Artist.find_or_create_by(artist_params)
---
UPDATE "songs" SET "name" = $1, "artist_id" = $2 WHERE "songs"."id" = $3  [["name", "Since I Fell for Me"], ["artist_id", 7], ["id", 6]]
INSERT INTO "song_genres" ("song_id", "genre_id") VALUES ($1, $2) RETURNING "id"  [["song_id", 2], ["genre_id", 4]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "song_genres" ON "genres"."id" = "song_genres"."genre_id" WHERE "song_genres"."song_id" = $1  [["song_id", 2]]
INSERT INTO "artists" ("name") VALUES ($1) RETURNING "id"  [["name", "hello kitty"]]

  def destroy
    @song.song_genres.each do |song_genre|
      song_genre.destroy
---
SELECT  "song_genres".* FROM "song_genres" WHERE "song_genres"."song_id" = $1 ORDER BY "song_genres"."id" ASC LIMIT $2  [["song_id", 4], ["LIMIT", 1]]
DELETE FROM "song_genres" WHERE "song_genres"."id" = $1  [["id", 10]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 2]]

  def set_song
    @song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]